<template>
  <div class="wrapper">
    <ul class="content">
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
      <li>爱上大为阿不送到哪 会隔一天</li>
    </ul>
  </div>
</template>

<script>
// 引入 betterscroll 插件
import BScroll from 'better-scroll'
export default {
  
  name:"Category",
  // 这里不能用created（）生命周期函数
  // 是因为当组件创建完成之后，created（）函数进行调用的时候
  // html还没被挂载到页面上去，所以根本获取不到.wrapper这个html元素
  mounted(){
    this.scroll = new BScroll('.wrapper',{

    })
  }
}


</script>

<style>
  .wrapper{
    height:150px;
    background:#bfa;
    /* 这里可以通过是否隐藏，来决定在哪块区域滚动 */
    /* overflow: hidden; */
  }
</style>